vcd2saif_readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-24 金 03:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>VCD2SAIF</title>
<meta name="author" content="grunt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">VCD2SAIF</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc4b95db">1. 機能</a></li>
<li><a href="#org7365071">2. 環境準備</a>
<ul>
<li><a href="#org2cebf34">2.1. Ubuntu</a></li>
<li><a href="#org388da0d">2.2. LISP</a></li>
<li><a href="#org12d546f">2.3. Python</a></li>
</ul>
</li>
<li><a href="#orge6861a7">3. 使い方</a>
<ul>
<li><a href="#orgaa96f3c">3.1. VCDファイルをSAIFファイルに変換します</a></li>
<li><a href="#org6156975">3.2. VCDファイルを時間間隔で分割して複数のSAIFファイルに変換する</a></li>
<li><a href="#org11f555d">3.3. 動作時間とダイナミック消費電力CSVファイルを作成します</a></li>
</ul>
</li>
<li><a href="#org2933b50">4. 測定原理</a>
<ul>
<li><a href="#orgdb31fa0">4.1. SAIF ファイル</a></li>
<li><a href="#org3928dfa">4.2. VCD ファイル</a></li>
<li><a href="#org38a4299">4.3. 時間変化電力解析</a></li>
<li><a href="#orge9e9228">4.4. 時間間隔について</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc4b95db" class="outline-2">
<h2 id="orgc4b95db"><span class="section-number-2">1.</span> 機能</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>VCDファイルをSAIFファイルに変換します</li>
<li>VCDファイルを時間間隔で分割して複数のSAIFファイルに変換します
<ul class="org-ul">
<li>Vivadoで電力レポートを生成するためのスクリプトを生成します</li>
</ul></li>
<li>動作時間とダイナミック消費電力CSVファイルを作成します</li>
</ul>
</div>
</div>
<div id="outline-container-org7365071" class="outline-2">
<h2 id="org7365071"><span class="section-number-2">2.</span> 環境準備</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2cebf34" class="outline-3">
<h3 id="org2cebf34"><span class="section-number-3">2.1.</span> Ubuntu</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://ubuntu.com/download">Ubuntu Desktop</a>
<ul class="org-ul">
<li>必要ではない、お勧めです</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org388da0d" class="outline-3">
<h3 id="org388da0d"><span class="section-number-3">2.2.</span> LISP</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Compiler
<ul class="org-ul">
<li><a href="http://www.sbcl.org/">Steel Bank Common Lisp</a>
<ul class="org-ul">
<li>必要です</li>
</ul></li>
</ul></li>
<li>Editor
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>
<ul class="org-ul">
<li>必要ではない、お勧めです</li>
</ul></li>
<li>Plugins
<ul class="org-ul">
<li><a href="https://common-lisp.net/project/slime/">SLIME: The Superior Lisp Interaction Mode for Emacs</a>
<ul class="org-ul">
<li>必要ではない、お勧めです</li>
</ul></li>
<li><a href="https://www.spacemacs.org/">Spacemacs</a>
<ul class="org-ul">
<li>必要ではない、お勧めです</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org12d546f" class="outline-3">
<h3 id="org12d546f"><span class="section-number-3">2.3.</span> Python</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://www.python.org/downloads/">Python3</a>
<ul class="org-ul">
<li>必要です</li>
</ul></li>
<li><a href="https://jupyter.org/">The Jupyter Notebook</a>
<ul class="org-ul">
<li>必要ではない、お勧めです</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge6861a7" class="outline-2">
<h2 id="orge6861a7"><span class="section-number-2">3.</span> 使い方</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaa96f3c" class="outline-3">
<h3 id="orgaa96f3c"><span class="section-number-3">3.1.</span> VCDファイルをSAIFファイルに変換します</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>LISP環境起動します
<ol class="org-ol">
<li>CMDやTerminalやEmacsでLISP環境起動できます</li>
<li>EmacsやSpacemacsのSLIMEでLISP環境を運行するのがお勧めです</li>
<li>起動完成したら、(+ 1 1)を入力して、2を出力します</li>
</ol></li>
<li><p>
VCD2SAIFをロードします
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #0000c11cbffc;">CL-USER&gt;</span> <span style="color: #4f97d7;">(</span><span style="color: #f8f08a2fa5a9;">load</span> <span style="color: #2d9574;">"vcd2saif.lisp"</span><span style="color: #4f97d7;">)</span>
<span style="color: #f19a8bcabb41;">T</span>
<span style="color: #0000c11cbffc;">CL-USER&gt;</span> <span style="color: #4f97d7;">(</span><span style="color: #bfaf9c5aebc5;">use-package</span> '<span style="color: #b202af9b5a0a;">package_vcd2saif</span><span style="color: #4f97d7;">)</span>
<span style="color: #f19a8bcabb41;">T</span>
</pre>
</div></li>
<li><p>
VCDファイルをSAIFファイルに変換します
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #0000c11cbffc;">CL-USER&gt;</span> <span style="color: #4f97d7;">(</span><span style="color: #961cb6856506;">vcd2saif</span> <span style="color: #2d9574;">"aes_enc_t_test.vcd"</span> <span style="color: #4f97d7;">:simulation_time</span> <span style="color: #a45bad;">239190000</span><span style="color: #4f97d7;">)</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #df3a9e346074;">aes_enc_t_test_vcd2saif.saif</span>
<span style="color: #e9f5986169af;">Final</span> <span style="color: #c69aa8d05823;">RUN</span> <span style="color: #6296bde784eb;">TIME:</span> <span style="color: #a45bad;">25.685743</span> <span style="color: #446ebfd796f5;">S</span>
<span style="color: #f6f98a64ad9d;">NIL</span>
</pre>
</div>
<ol class="org-ol">
<li>入力VCDファイル
<ol class="org-ol">
<li>"aes_enc_t_test.vcd"
<ol class="org-ol">
<li>変換したいVCDファイルです</li>
</ol></li>
</ol></li>
<li>シミュレーション消費時間
<ol class="org-ol">
<li>:simulation_time 239190000
<ol class="org-ol">
<li>必要引数ではないです、シミュレーション最後の時間情報がVCDファイルに記録していない場合があるので、ここで指定します、指定しなくでも正常に動作できます</li>
</ol></li>
</ol></li>
<li>出力
<ol class="org-ol">
<li>SAIFファイル</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org6156975" class="outline-3">
<h3 id="org6156975"><span class="section-number-3">3.2.</span> VCDファイルを時間間隔で分割して複数のSAIFファイルに変換する</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>LISP環境起動します</li>
<li>VCD2SAIFをロードします</li>
<li><p>
VCDファイルを時間間隔で分割して複数のSAIFファイルに変換します
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #0000c11cbffc;">CL-USER&gt;</span> <span style="color: #4f97d7;">(</span><span style="color: #961cb6856506;">vcd2saif</span> <span style="color: #2d9574;">"aes_enc_t_test.vcd"</span> <span style="color: #4f97d7;">:simulation_time</span> <span style="color: #a45bad;">239190000</span> <span style="color: #4f97d7;">:split_interval</span> <span style="color: #a45bad;">10000</span> <span style="color: #4f97d7;">:tcl_count</span> <span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #0000c116c130;">aes_enc_t_test_0_10000_vcd2saif.saif</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #4a20bf9393d6;">aes_enc_t_test_10000_20000_vcd2saif.saif</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #89feb8d26bc4;">aes_enc_t_test_20000_30000_vcd2saif.saif</span>
<span style="color: #5cbfb1a0fd26;">......</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #d76194c2dc36;">aes_enc_t_test_239160000_239170000_vcd2saif.saif</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #0000bc87ebb6;">aes_enc_t_test_239170000_239180000_vcd2saif.saif</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #0000c03fd298;">aes_enc_t_test_239180000_239190000_vcd2saif.saif</span>
<span style="color: #eeba8cb4c0a5;">SAIF</span> <span style="color: #97f8b6216413;">file:</span> <span style="color: #df3a9e346074;">aes_enc_t_test_vcd2saif.saif</span>
<span style="color: #ee4c95b66f1a;">Power</span> <span style="color: #0000bf8ada1c;">analysis</span> <span style="color: #c0ac9c0eeb43;">script:</span> <span style="color: #fa638b489491;">aes_enc_t_test_vcd2saif.tcl</span>
<span style="color: #821dba1e708b;">Saif</span> <span style="color: #fa6a8b189621;">file</span> <span style="color: #b14fafd05a37;">count:</span> <span style="color: #a45bad;">23920</span>
<span style="color: #0000c076cf9e;">Split</span> <span style="color: #ee4c95b66f1a;">Power</span> <span style="color: #0000bf8ada1c;">analysis</span> <span style="color: #c0ac9c0eeb43;">script:</span> <span style="color: #ae8ba138f314;">aes_enc_t_test_0_5980_vcd2saif.tcl</span>
<span style="color: #0000c076cf9e;">Split</span> <span style="color: #ee4c95b66f1a;">Power</span> <span style="color: #0000bf8ada1c;">analysis</span> <span style="color: #c0ac9c0eeb43;">script:</span> <span style="color: #ee8195946f64;">aes_enc_t_test_5980_11960_vcd2saif.tcl</span>
<span style="color: #0000c076cf9e;">Split</span> <span style="color: #ee4c95b66f1a;">Power</span> <span style="color: #0000bf8ada1c;">analysis</span> <span style="color: #c0ac9c0eeb43;">script:</span> <span style="color: #e4f4900ecea0;">aes_enc_t_test_11960_17940_vcd2saif.tcl</span>
<span style="color: #0000c076cf9e;">Split</span> <span style="color: #ee4c95b66f1a;">Power</span> <span style="color: #0000bf8ada1c;">analysis</span> <span style="color: #c0ac9c0eeb43;">script:</span> <span style="color: #36a3c0559dc4;">aes_enc_t_test_17940_23920_vcd2saif.tcl</span>
<span style="color: #e9f5986169af;">Final</span> <span style="color: #c69aa8d05823;">RUN</span> <span style="color: #6296bde784eb;">TIME:</span> <span style="color: #a45bad;">3149.9126</span> <span style="color: #446ebfd796f5;">S</span>
<span style="color: #f6f98a64ad9d;">NIL</span>
</pre>
</div>
<ol class="org-ol">
<li>入力VCDファイル
<ol class="org-ol">
<li>"aes_enc_t_test.vcd"</li>
</ol></li>
<li>シミュレーション消費時間
<ol class="org-ol">
<li>:simulation_time 239190000</li>
</ol></li>
<li>分割間隔
<ol class="org-ol">
<li>:split_interval 10000</li>
</ol></li>
<li>電力解析スクリプト分割数
<ol class="org-ol">
<li>:tcl_count 4
<ol class="org-ol">
<li>必要引数ではないです、生成したSAIFファイルが非常に多いの時に、複数のVivadoで電力解析を実行するため、この引数を使います</li>
</ol></li>
</ol></li>
<li>出力
<ol class="org-ol">
<li>複数SAIFファイル</li>
<li>電力解析スクリプト
<ol class="org-ol">
<li>Vivadoのコンソールに使えます</li>
</ol></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org11f555d" class="outline-3">
<h3 id="org11f555d"><span class="section-number-3">3.3.</span> 動作時間とダイナミック消費電力CSVファイルを作成します</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>この部分はPython3で書いているので、Python3が必要です</li>
<li><p>
機能は複数の電力レポートのダイナミック消費電力データを読み込んで、時間と消費電力のCSVファイルを作ることです
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a229a469f6e3;">vcd2saif_power</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'aes_encrypt_vcd2saif.tcl'</span><span style="color: #4f97d7;">)</span>
<span style="color: #8352b9ee6fcb;">dynamic</span> <span style="color: #f9e18a549fa9;">power</span>: <span style="color: #5a58b1f3fd0d;">aes_encrypt_vcd2saif_power</span>.<span style="color: #f9a88a43a160;">csv</span>
</pre>
</div>
<ol class="org-ol">
<li>入力ファイル
<ol class="org-ol">
<li>'aes_encrypt_vcd2saif.tcl'
<ol class="org-ol">
<li>電力解析スクリプト
<ol class="org-ol">
<li>関数が電力解析スクリプトから電力レポートのファイル名を読み込んで、電力レポートからダイナミック消費電力を読み込みます</li>
<li>分割電力解析スクリプト引数指定しても、一つ分割しない電力スクリプトを出力するはず、この分割しない電力スクリプトを入力してください</li>
</ol></li>
</ol></li>
</ol></li>
<li>出力
<ol class="org-ol">
<li>時間と消費電力のCSVファイル
<ol class="org-ol">
<li>aes_encrypt_vcd2saif_power.csv</li>
</ol></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org2933b50" class="outline-2">
<h2 id="org2933b50"><span class="section-number-2">4.</span> 測定原理</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgdb31fa0" class="outline-3">
<h3 id="orgdb31fa0"><span class="section-number-3">4.1.</span> SAIF ファイル</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example" id="orgf20654b">
(ap_clk (T0 14110000) (T1 14105000) (TX 0) (TZ 0) (TB 0) (TC 5643)
</pre>
<p>
信号ap_clkがT0状態を維持14110000ps、T1状態を維持14105000ps、反転回数が5643である。
</p>
</div>
</div>
<div id="outline-container-org3928dfa" class="outline-3">
<h3 id="org3928dfa"><span class="section-number-3">4.2.</span> VCD ファイル</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example" id="org60f0a07">
$var wire 1 ! ap_clk $end
#0
0!
#5000
1!
#10000
0!
#15000
1!
...
</pre>
<p>
信号ap_clkが0psに0になり、5000psに1になり、10000psに0になり、15000psに1になり
</p>
</div>
</div>
<div id="outline-container-org38a4299" class="outline-3">
<h3 id="org38a4299"><span class="section-number-3">4.3.</span> 時間変化電力解析</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>信号の周波数が消費電力に影響がある。</li>
<li>SIAFファイルのTCが実は信号の平均周波数である。</li>
<li>時間変化消費電力解析するため、信号の平均周波数ではなく、信号の周波数の時間変化を測定するのは必要である。</li>
<li>VCD2SAIFツールでVCDファイルをSAIFファイルに変換し、分割したSAIFファイルがその短時間の時間間隔の信号周波数を記録し、複数のSAIFファイルが信号の周波数の時間変化を記録している。</li>
</ul>
</div>
</div>
<div id="outline-container-orge9e9228" class="outline-3">
<h3 id="orge9e9228"><span class="section-number-3">4.4.</span> 時間間隔について</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>二つ異なる入力平文を暗号化操作します</li>
<li>回路周期が10nsを設定します</li>
<li>分割間隔が10nsと5nsを設定します</li>
<li>二つ平文暗号化操作に、不一致電力消費点を統計します</li>
<li>10nsと5ns分割して、不一致電力消費点が全部の測定点の割合が近似しています</li>
<li>ここは二つのtracing不一致ですが、T検定は消費電力の不一致を検定する、tracing数が100万以上</li>
<li>割合で評価すると、10nsと5ns分割した結果は似ています</li>
<li>まとめ：時間間隔が回路周期と同じで選択して良いです</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: grunt</p>
<p class="date">Created: 2023-03-24 金 03:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
